#include "map"
#include "bayes.hpp"

std::map<std::string, int> FawLearn::Bayes::m_map ({ { "PA", 0 }, { "PE", 1 }, { "PD", 2 }, { "PH", 3 }, { "PG", 4 }, { "PB", 5 }, { "PK", 6 }, { "NA", 7 }, { "NB", 8 }, { "NJ", 9 }, { "NH", 10 }, { "PF", 11 }, { "NI", 12 }, { "NC", 13 }, { "NG", 14 }, { "NE", 15 }, { "ND", 16 }, { "NN", 17 }, { "NK", 18 }, { "NL", 19 }, { "PC", 20 } });
std::map<int, std::string> FawLearn::Bayes::m_map2 ({ { 0, "¿ìÀÖ" }, { 1, "°²ÐÄ" }, { 2, "×ð¾´" }, { 3, "ÔÞÑï" }, { 4, "ÏàÐÅ" }, { 5, "Ï²°®" }, { 6, "×£Ô¸" }, { 7, "·ßÅ­" }, { 8, "±¯ÉË" }, { 9, "Ê§Íû" }, { 10, "¾Î" }, { 11, "Ë¼" }, { 12, "»Å" }, { 13, "¿Ö¾å" }, { 14, "Ðß" }, { 15, "·³ÃÆ" }, { 16, "Ô÷¶ñ" }, { 17, "±áÔð" }, { 18, "¶Ê¼É" }, { 19, "»³ÒÉ" }, { 20, "¾ªÆæ" } });
